Tekla Open API Reference for Tekla Structures 2025
Assembly.Add Method
Overload List
Name | Description
Add(ArrayList)
 Adds an array list of given assemblable instances to the assembly. For assemblies use Add(Assembly Assembly). Notice that adding other than assembly instances will actually assume that you are adding objects to a cast unit assembly.
Add(Assembly)
 Adds a new subassembly for the assembly instance.
Add(IAssemblable)
 Adds the given assemblable instance to the assembly. Notice that adding other than assembly instances will assume that you are adding objects to a cast unit assembly.
Top
See Also
Reference
Assembly Class
Tekla.Structures.Model Namespace